app/Controllers/Aluno.php

    public function index(){
        $dados = $this->alunoModel->findAll();
---
SELECT *
FROM `aluno`