app/Controllers/Editora.php

    public function index(){
        $dados = $this->editoraModel->findAll();
---
SELECT *
FROM `editora`

    public function editar($id){
        $dados = $this->editoraModel->find($id);
---
SELECT *
FROM `editora`
WHERE `editora`.`id` = '5'

    public function salvar(){
        $editora = $this->request->getPost();
        $this->editoraModel->save($editora);
---
UPDATE `editora` SET `nome` = 'ead', `email` = 'tyjtj@da666856756756', `telefone` = 'ewewa'
WHERE `editora`.`id` IN ('3')