app/Controllers/Emprestimo.php

    public function index(){
        $emprestimo = $this->EmprestimoModel->findAll();
        $livro = $this->livroModel->findAll();
        $dadosobra = $this->obraModel->findAll();
        $aluno = $this->alunoModel->findAll();
        $usuario = $this->usuarioModel->findAll();
---
SELECT *
FROM `emprestimo`
SELECT *
FROM `livro`
SELECT *
FROM `obra`
SELECT *
FROM `aluno`
SELECT *
FROM `usuario`

    public function cadastrar()
    {
        $dados = $this->request->getPost();
        $this->EmprestimoModel->save($dados);
---
INSERT INTO `emprestimo` (`data_inicio`, `data_fim`, `data_prazo`, `id_livro`, `id_aluno`, `id_usuario`) VALUES ('16', '11', '15', '19', '10', '20')