app/Controllers/Livro.php

INSERT INTO `livro` (`disponivel`, `status`, `id_obra`) VALUES ('fgxdfgh', 'hdfghdf', '1')
---
        public function salvar(){
            $livro = $this->request->getPost();
            $this->livroModel->save($livro);