app/Controllers/Login.php

    public function authenticate()
    {
        $email = $this->request->getPost('email');
        $senha = $this->request->getPost('senha');

        if (empty($email) || empty($senha)) {
            return redirect()->back()->withInput()->with('error', 'Preencha todos os campos!');
        }

        $db = \Config\Database::connect();

        $query = $db->table('usuario')->where('email', $email)->where('senha', $senha)->get();
---
SELECT *
FROM `usuario`
WHERE `email` = 'nome@gmail.com'
AND `senha` = 'info204'