app/Controllers/Usuario.php

INSERT INTO `usuario` (`nome`, `email`, `telefone`, `senha`) VALUES ('Heden', 'heden@gmail.com', '(85) 96709-8756', 'e3050067fc0bb156ab4904c7b2b5a2b7')
---
    public function salvar(){
        $usuario = $this->request->getPost();
        $this->usuarioModel->save($usuario);

DELETE FROM `usuario`
WHERE `id` IN ('20')
---
    public function excluir($id){

        $this->usuarioModel->delete($id);